#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113501629157]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113501629141]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113501629146]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113501629142]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113501629162]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113501629143]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113402076881]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113501629153]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113501629144]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113501629151]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113501629147]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113501629140]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113501629156]
sakuracloud_disk.k8s_lb_disk[0]: Refreshing state... [id=113501629149]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113501629148]
sakuracloud_disk.k8s_lb_disk[1]: Refreshing state... [id=113501629152]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15311]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113501629165]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113501629166]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113501629181]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113501629167]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113501629183]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113501629180]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113501629182]
sakuracloud_server.k8s_lb[1]: Refreshing state... [id=113501629174]
sakuracloud_server.k8s_lb[0]: Refreshing state... [id=113501629173]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501629140" -> (known after apply)
        name              = "k8s-control-plane-1-dev"
      ~ server_id         = "113501629166" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501629151" -> (known after apply)
        name              = "k8s-control-plane-2-dev"
      ~ server_id         = "113501629165" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501629144" -> (known after apply)
        name              = "k8s-control-plane-3-dev"
      ~ server_id         = "113501629167" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501629149" -> (known after apply)
        name              = "k8s-lb-1-dev"
      ~ server_id         = "113501629173" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501629152" -> (known after apply)
        name              = "k8s-lb-2-dev"
      ~ server_id         = "113501629174" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113501629148" -> (known after apply)
        name              = "k8s-router-1-dev"
      ~ server_id         = "113501629181" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501629147" -> (known after apply)
        name              = "k8s-worker-node-1-dev"
      ~ server_id         = "113501629183" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501629156" -> (known after apply)
        name              = "k8s-worker-node-2-dev"
      ~ server_id         = "113501629182" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501629153" -> (known after apply)
        name              = "k8s-worker-node-3-dev"
      ~ server_id         = "113501629180" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501629140",
        ] -> (known after apply)
        id               = "113501629166"
        name             = "k8s-control-plane-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501629151",
        ] -> (known after apply)
        id               = "113501629165"
        name             = "k8s-control-plane-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501629144",
        ] -> (known after apply)
        id               = "113501629167"
        name             = "k8s-control-plane-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501629149",
        ] -> (known after apply)
        id               = "113501629173"
        name             = "k8s-lb-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501629152",
        ] -> (known after apply)
        id               = "113501629174"
        name             = "k8s-lb-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks            = [
          - "113501629148",
        ] -> (known after apply)
        id               = "113501629181"
        name             = "k8s-router-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501629147",
          - "113501629141",
        ] -> (known after apply)
        id               = "113501629183"
        name             = "k8s-worker-node-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501629156",
          - "113501629157",
        ] -> (known after apply)
        id               = "113501629182"
        name             = "k8s-worker-node-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501629153",
          - "113501629162",
        ] -> (known after apply)
        id               = "113501629180"
        name             = "k8s-worker-node-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 9 to add, 9 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>